[Reward_ResistanceLeader X2RewardTemplate]
DisplayName="Resistance Leader"
RewardDescriptions[0]=As a Resistance Leader in a small Resistance cell based out of <XGParam:StrValue0/!WorldRegionName/>, <XGParam:StrValue1/!UnitName/> developed a taste for guerrilla combat and burns to serve the Resistance on the front lines.

[CovertActionNarrative_PreparePersonnel_MRL X2CovertActionNarrativeTemplate]
ActionName="Investigate Capture"
ActionPreNarrative="Word from our informants is that ADVENT has recently arrested one of our Resistance Cell Leaders. In order to <XGParam:StrValue4/>, we need to find where ADVENT's keeping them."
ActionPostNarrative="Our operatives managed to find the high-profile prisoner, and better yet, a blind spot in the prison's security grid. We could strike now and potentially free them!"